app/controllers/users_controller.rb

  def index
    if signed_in? && current_user.admin?
      @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 04 Mar 2014 21:48:29 UTC +00:00], ["email", "keith@custombit.com"], ["name", "Keith Allen"], ["updated_at", Tue, 04 Mar 2014 21:48:29 UTC +00:00]]